# Importar Librerias

In [1]:
### Importar Librerias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Importar archivo .CSV

In [2]:
salaries = pd.read_csv("./Data/linkedin-jobs-usa.csv")

## Exploracion Inicial

In [3]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

## Tratamiento de duplicados

In [14]:
salaries_limpieza = salaries.copy()

In [6]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

In [8]:
salaries_limpieza.duplicated().count()

np.int64(2845)

In [10]:
salaries_limpieza[salaries_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [11]:
salaries_limpieza = salaries_limpieza.drop_duplicates

## Tratamiento de valores nulos NaN

### Visualizar los valores nulos

In [16]:
print(f"Valores NaN por columna {salaries_limpieza.isna().sum()}")

Valores NaN por columna title               0
company             0
description         0
onsite_remote       0
salary           1916
location            0
criteria            0
posted_date         0
link                0
dtype: int64

## 1era Opcion: Eliminar todos los valores nulos

In [21]:
df_sin_nulos = salaries.dropna()

In [22]:
df_sin_nulos_columnas = salaries.dropna(axis=1)

In [23]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary           0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [26]:
df_sin_nulos.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...

In [25]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

In [24]:
df_sin_nulos.shape

(929, 9)

### Axis =0 revisa por fila
### Axis =1 revisa por columna

- how = 'Any' -> Elimina si por lo menos hay un NAN
- how = 'All' -> Elimina si todos son NAN

In [ ]:
df_sin_nulos_columnas = salaries.dropna(axis=0,how='any')
df_sin_nulos_columnas = salaries.dropna(axis=0,how='all')

In [ ]:
df_sin_nulos_columnas = salaries.dropna(axis=1,how='any')
df_sin_nulos_columnas = salaries.dropna(axis=1,how='all')

## 2da Opcion: Remplazar NaNs por la media

Parsing de la columna salary

In [28]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [29]:
## Este código toma una columna 'salary' que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
#El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
#Esto es útil cuando la columna 'salary' inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos

df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
C:\Users\gusta\AppData\Local\Temp\ipykernel_11996\3141640928.py:6: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\gusta\AppData\Local\Temp\ipykernel_11996\3141640928.py:6: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\gusta\AppData\Local\Temp\ipykernel_11996\3141640928.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

In [33]:
import re

# Extrae el primer número válido (entero o decimal) de cada celda y lo convierte a float
df_sin_nulos['salary_numeric'].dtype

dtype('float64')